Repository: ESSolutions/ESSArch_Tools_Archive
Catalog: ESSArch_*/docs/locale/*/LC_MESSAGES/user_guide/reception.po
Languages: sv

source: Receive SIP is the first step in ETA. IPs that have arrived to the ETA reception are listed in the reception list view.
sv: Ta emot SIP är det första steget i ETA. IPn som har kommit till ETAs reception finns listade i receptionens listvy.

source: Receive
sv: Ta emot

source: To receive an IP, check the checkbox at the start of the table row of the IP to include it for receive. Many IPs can be selected at the same time.
sv: För att ta emot ett IP, markera kryssruran i början på IPts rad för att markera det för mottagande. Flera IPn kan väljas samtidigt.

source: When desired IPs are included click the **Receive**-button in the bottom right corner.
sv: När alla IPn som ska tas emot är markerade klicka på **Ta emot** nere till höger.

source: Clicking the **Receive**-button will open a window to receive the first included IP.
sv: När **Ta emot** klickas kommer ett fönster för att ta emot det första IPt som valdes.

source: Profile Editor
sv: Profileditor

source: Use the select dropdown to choose what submission agreement to use, then click **Prepare**.
sv: Använd rullistan för att välja leveransöverenskommelse som ska användas. Klicka sedan **Förbered**.

source: If the dropdown is disabled, the IP already has a related Submission agreement.
sv: Om rullistan är inaktiverad så är IPt redan kopplat till en leveransöverenskommelse.

source: If IP in reception has a defined Submission Agreement that does not exist in the database, an error message is shown.
sv: Om IPt i receptionen har en definerad leveransöverenskommelse som inte finns i databasen, visas ett felmeddelande.

source: The profile editor is where the user can edit data of a profile for a specific IP. The Submission agreements data fields can only be viewed by clicking the **view** button next to the SA dropdown.
sv: I profileditorn kan en användare editera data i en profil för ett specifikt IP. Data-fälten för en leveransöverenskommelse kan bara läsas genom att klicka på **Visa**-knappen bredvid rullistan.

source: Underneath the Submission agreement row, all relevant profiles are listed. Click **edit** next to a profile to edit the data of the profile for the IP to be received.
sv: Under raden för leveransöverenskommelse finns alla relevanta profiler listade. Klicka på **Redigera** för att redigera profil-data för IPt som ska tas emot.

source: When satisfied with the edit click **Save**.
sv: Klicka sedan **Spara** när editeringen är färdig.

source: When saving profile data, the previous versions are still available in the version dropdown. Choose between data versions and click save to apply.
sv: När man sparar profil-data så sparas alla tidigare versioner av datat och kan väljas i version-rullistan. Välj mellan versioner och klicka **Spara** för att spara.

source: This can be done on each profile type, remember to save the data before closing the profile form.
sv: Detta kan göras på alla profiltyper. Kom ihåg att spara datat så det inte går förlorat.

source: When selection of Submission agreement and profiles is done. Check the **Approved to receive**-checkbox and click **Receive SIP**. The process of receiving the IP is started and if more IPs are included a receive window for the next IP will appear. An IP can be skipped by clicking the **Skip**-button, then the receive window for the next included IP will appear, if there is one.
sv: När leveransöverenskommelse är vald, markera **Godkänd att ta emot** och klicka på **Ta emot SIP**. Mottagande påbörjas och om fler IPn är markerade öppnas ett nytt fönster för att ta emot nästa markerade IP. Om man klickar **Avbryt** kommer mottagande-fönstret stängas ned, men samtliga markerade IPn kommer fortfarande vara markerade. Klickar vi på **Hoppa över** så avmarkeras det nuvarande IPt och ett mottagande-fönster för nästa markerade IP visas.

source: When IP is received it is no longer visible in the reception list view and can be found in either Workarea list views or the list view in Transfer SIP.
sv: När ett IP tagits emot hittas det inte längre i listvyn i reception utan det kan hittas i :ref:`Arbetsytans <workspace>` listvyer eller under :ref:`Överför SIP <transfer-sip>`.
